---
kind: property
id: P:Autodesk.Revit.DB.NurbsSurfaceData.IsRational
source: html/da17256f-3c20-22c0-1619-5fe2d847752a.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.IsRational Property

Tells if the spline is rational or not.
 If it is true (rational), then the NURBS is a piecewise rational polynomial function.
 If it is false (non-rational), then the NURBS is a piecewise polynomial function.

## Syntax (C#)
```csharp
public bool IsRational { get; }
```